# Cleaning and Tidying Data in Pandas

## Tips and Tricks

In [1]:
import pandas as pd 
import numpy as np

df = pd.read_csv('C:\\Users\\r0dne\\Downloads\\CSVs\\us2021census.csv')

In [37]:
df

,City,State,Type,Counties,Population,Latitude,Longitude
0,New York,NY,City,Bronx;Richmond;New York;Kings;Queens,8804190,40.714,-74.007
1,Los Angeles,CA,City,Los Angeles,3898747,34.052,-118.243
2,Chicago,IL,City,Cook;DuPage,2746388,41.882,-87.628
3,Houston,TX,City,Harris;Fort Bend;Montgomery,2304580,29.760,-95.363
4,Phoenix,AZ,City,Maricopa,1608139,33.448,-112.074
...,...,...,...,...,...,...,...
21392,Hoot Owl,OK,Town,Mayes,0,36.360,-95.121
21393,Lakeside,MO,City,Miller,0,38.202,-92.629
21394,Mustang,TX,Town,Navarro,0,32.012,-96.432
21395,South Park View,KY,City,Jefferson,0,38.119,-85.719
21396,Spencer Mountain,NC,Town,Gaston,0,35.309,-81.113

In [15]:
df.dtypes

City           object
State          object
Type           object
Counties       object
Population      int64
Latitude      float64
Longitude     float64
dtype: object

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
# Read and count rows and columns
df.shape

(21397, 7)

In [39]:
df.head()

,City,State,Type,Counties,Population,Latitude,Longitude
0,New York,NY,City,Bronx;Richmond;New York;Kings;Queens,8804190,40.714,-74.007
1,Los Angeles,CA,City,Los Angeles,3898747,34.052,-118.243
2,Chicago,IL,City,Cook;DuPage,2746388,41.882,-87.628
3,Houston,TX,City,Harris;Fort Bend;Montgomery,2304580,29.760,-95.363
4,Phoenix,AZ,City,Maricopa,1608139,33.448,-112.074

In [41]:
# Find out what the info in the arrays
df.values

array([['New York', 'NY', 'City', ..., 8804190, 40.714, -74.007],
       ['Los Angeles', 'CA', 'City', ..., 3898747, 34.052, -118.243],
       ['Chicago', 'IL', 'City', ..., 2746388, 41.882, -87.628],
       ...,
       ['Mustang', 'TX', 'Town', ..., 0, 32.012, -96.432],
       ['South Park View', 'KY', 'City', ..., 0, 38.119, -85.719],
       ['Spencer Mountain', 'NC', 'Town', ..., 0, 35.309, -81.113]],
      dtype=object)

In [17]:
# Find out what type the header columns
df.columns

Index(['City', 'State', 'Type', 'Counties', 'Population', 'Latitude',
       'Longitude'],
      dtype='object')

In [44]:
# Find out type and info 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21397 entries, 0 to 21396
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        21397 non-null  object
 1   State       21397 non-null  object
 2   Type        21397 non-null  object
 3   Counties    21397 non-null  object
 4   Population  21397 non-null  int64
 5   Latitude    21397 non-null  float64
 6   Longitude   21397 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 1.1+ MB

In [38]:
# Using the loc and iloc to find multiple columns and / or rows. Or subset of rows or columns

df.loc[df['Type'] == 'City', ['Counties', 'Population']]

                                   Counties  Population
0      Bronx;Richmond;New York;Kings;Queens     8804190
1                               Los Angeles     3898747
2                               Cook;DuPage     2746388
3               Harris;Fort Bend;Montgomery     2304580
4                                  Maricopa     1608139
...                                     ...         ...
21375                               Fremont           4
21379                           Baker;Grant           3
21387                                McLean           1
21393                                Miller           0
21395                             Jefferson           0

[10156 rows x 2 columns]

In [45]:
# What to find a single column
df['Type']

0        City
1        City
2        City
3        City
4        City
         ...
21392    Town
21393    City
21394    Town
21395    City
21396    Town
Name: Type, Length: 21397, dtype: object

In [46]:
type_df = df['Type']

In [47]:
type_df.head()

0    City
1    City
2    City
3    City
4    City
Name: Type, dtype: object

In [48]:
# Multiple columns use two sets of square brackets [[]]
 
subset = df[['City', 'State', 'Population']]

In [49]:
subset

                   City State  Population
0              New York    NY     8804190
1           Los Angeles    CA     3898747
2               Chicago    IL     2746388
3               Houston    TX     2304580
4               Phoenix    AZ     1608139
...                 ...   ...         ...
21392          Hoot Owl    OK           0
21393          Lakeside    MO           0
21394           Mustang    TX           0
21395   South Park View    KY           0
21396  Spencer Mountain    NC           0

[21397 rows x 3 columns]

In [50]:
# Check what version you are using
pd.__version__

'1.3.3'

In [51]:
# Finding the most populated counties in California 
df.loc[df['State'] == 'CA', ['Counties', 'City', 'Population']]

            Counties           City  Population
1        Los Angeles    Los Angeles     3898747
7          San Diego      San Diego     1386932
9        Santa Clara       San Jose     1013240
16     San Francisco  San Francisco      873965
33            Fresno         Fresno      542107
...              ...            ...         ...
16624       Monterey      Sand City         325
16833       Humboldt       Trinidad         307
17381    Los Angeles       Industry         264
17968    Los Angeles         Vernon         222
18310         Amador    Amador City         200

[482 rows x 3 columns]

In [52]:
# Finding the most populated counties in Texas 
df.loc[df['State'] == 'TX', ['Counties', 'City', 'Population']]

                                    Counties         City  Population
3                Harris;Fort Bend;Montgomery      Houston     2304580
6                                      Bexar  San Antonio     1434625
8      Rockwall;Denton;Kaufman;Dallas;Collin       Dallas     1304379
10                    Williamson;Travis;Hays       Austin      961855
12                Wise;Denton;Parker;Tarrant   Fort Worth      918915
...                                      ...          ...         ...
21091                                 Denton       Draper          33
21162                                 Dawson   Los Ybanez          28
21188                               Brazoria     Quintana          26
21227                                 Taylor       Impact          22
21394                                Navarro      Mustang           0

[1223 rows x 3 columns]